littlekernel/lk/external/platform/TivaWare_C_Series-2.2.0.295/inc/tm4c123gh6pge.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port H.
//
//*****************************************************************************
#define GPIO_PCTL_PH7_M         0xF0000000  // PH7 Mask
#define GPIO_PCTL_PH7_SSI2TX    0x20000000  // SSI2TX on PH7
#define GPIO_PCTL_PH7_M0PWM7    0x40000000  // M0PWM7 on PH7
#define GPIO_PCTL_PH7_WT4CCP1   0x70000000  // WT4CCP1 on PH7
#define GPIO_PCTL_PH6_M         0x0F000000  // PH6 Mask
#define GPIO_PCTL_PH6_SSI2RX    0x02000000  // SSI2RX on PH6
#define GPIO_PCTL_PH6_M0PWM6    0x04000000  // M0PWM6 on PH6
#define GPIO_PCTL_PH6_WT4CCP0   0x07000000  // WT4CCP0 on PH6
#define GPIO_PCTL_PH5_M         0x00F00000  // PH5 Mask
#define GPIO_PCTL_PH5_SSI2FSS   0x00200000  // SSI2FSS on PH5
#define GPIO_PCTL_PH5_M0PWM5    0x00400000  // M0PWM5 on PH5
#define GPIO_PCTL_PH5_PHB0      0x00500000  // PHB0 on PH5
#define GPIO_PCTL_PH5_WT3CCP1   0x00700000  // WT3CCP1 on PH5
#define GPIO_PCTL_PH4_M         0x000F0000  // PH4 Mask
#define GPIO_PCTL_PH4_SSI2CLK   0x00020000  // SSI2CLK on PH4
#define GPIO_PCTL_PH4_M0PWM4    0x00040000  // M0PWM4 on PH4
#define GPIO_PCTL_PH4_PHA0      0x00050000  // PHA0 on PH4
#define GPIO_PCTL_PH4_WT3CCP0   0x00070000  // WT3CCP0 on PH4
#define GPIO_PCTL_PH3_M         0x0000F000  // PH3 Mask
#define GPIO_PCTL_PH3_SSI3TX    0x00002000  // SSI3TX on PH3
#define GPIO_PCTL_PH3_M0PWM3    0x00004000  // M0PWM3 on PH3
#define GPIO_PCTL_PH3_M0FAULT3  0x00006000  // M0FAULT3 on PH3
#define GPIO_PCTL_PH3_WT5CCP1   0x00007000  // WT5CCP1 on PH3
#define GPIO_PCTL_PH2_M         0x00000F00  // PH2 Mask
#define GPIO_PCTL_PH2_SSI3RX    0x00000200  // SSI3RX on PH2
#define GPIO_PCTL_PH2_M0PWM2    0x00000400  // M0PWM2 on PH2
#define GPIO_PCTL_PH2_M0FAULT2  0x00000600  // M0FAULT2 on PH2
#define GPIO_PCTL_PH2_WT5CCP0   0x00000700  // WT5CCP0 on PH2
#define GPIO_PCTL_PH1_M         0x000000F0  // PH1 Mask
#define GPIO_PCTL_PH1_SSI3FSS   0x00000020  // SSI3FSS on PH1
#define GPIO_PCTL_PH1_M0PWM1    0x00000040  // M0PWM1 on PH1
#define GPIO_PCTL_PH1_IDX0      0x00000050  // IDX0 on PH1
#define GPIO_PCTL_PH1_M0FAULT1  0x00000060  // M0FAULT1 on PH1
#define GPIO_PCTL_PH1_WT2CCP1   0x00000070  // WT2CCP1 on PH1
#define GPIO_PCTL_PH0_M         0x0000000F  // PH0 Mask
#define GPIO_PCTL_PH0_SSI3CLK   0x00000002  // SSI3CLK on PH0
#define GPIO_PCTL_PH0_M0PWM0    0x00000004  // M0PWM0 on PH0
#define GPIO_PCTL_PH0_M0FAULT0  0x00000006  // M0FAULT0 on PH0
#define GPIO_PCTL_PH0_WT2CCP0   0x00000007  // WT2CCP0 on PH0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port J.
//
//*****************************************************************************
#define GPIO_PCTL_PJ7_M         0xF0000000  // PJ7 Mask
#define GPIO_PCTL_PJ6_M         0x0F000000  // PJ6 Mask
#define GPIO_PCTL_PJ5_M         0x00F00000  // PJ5 Mask
#define GPIO_PCTL_PJ5_C2M       0x00000000  // C2- on PJ5
#define GPIO_PCTL_PJ5_U6TX      0x00100000  // U6TX on PJ5
#define GPIO_PCTL_PJ5_T3CCP1    0x00700000  // T3CCP1 on PJ5
#define GPIO_PCTL_PJ4_M         0x000F0000  // PJ4 Mask
#define GPIO_PCTL_PJ4_C2P       0x00000000  // C2+ on PJ4
#define GPIO_PCTL_PJ4_U6RX      0x00010000  // U6RX on PJ4
#define GPIO_PCTL_PJ4_T3CCP0    0x00070000  // T3CCP0 on PJ4
#define GPIO_PCTL_PJ3_M         0x0000F000  // PJ3 Mask
#define GPIO_PCTL_PJ3_U5TX      0x00001000  // U5TX on PJ3
#define GPIO_PCTL_PJ3_T2CCP1    0x00007000  // T2CCP1 on PJ3
#define GPIO_PCTL_PJ2_M         0x00000F00  // PJ2 Mask
#define GPIO_PCTL_PJ2_U5RX      0x00000100  // U5RX on PJ2
#define GPIO_PCTL_PJ2_IDX0      0x00000500  // IDX0 on PJ2
#define GPIO_PCTL_PJ2_T2CCP0    0x00000700  // T2CCP0 on PJ2
#define GPIO_PCTL_PJ1_M         0x000000F0  // PJ1 Mask
#define GPIO_PCTL_PJ1_U4TX      0x00000010  // U4TX on PJ1
#define GPIO_PCTL_PJ1_T1CCP1    0x00000070  // T1CCP1 on PJ1
#define GPIO_PCTL_PJ0_M         0x0000000F  // PJ0 Mask
#define GPIO_PCTL_PJ0_U4RX      0x00000001  // U4RX on PJ0
#define GPIO_PCTL_PJ0_T1CCP0    0x00000007  // T1CCP0 on PJ0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port K.
//
//*****************************************************************************
#define GPIO_PCTL_PK7_M         0xF0000000  // PK7 Mask
#define GPIO_PCTL_PK7_M0FAULT3  0x60000000  // M0FAULT3 on PK7
#define GPIO_PCTL_PK7_WT1CCP1   0x70000000  // WT1CCP1 on PK7
#define GPIO_PCTL_PK6_M         0x0F000000  // PK6 Mask
#define GPIO_PCTL_PK6_M0FAULT2  0x06000000  // M0FAULT2 on PK6
#define GPIO_PCTL_PK6_WT1CCP0   0x07000000  // WT1CCP0 on PK6
#define GPIO_PCTL_PK6_C2O       0x08000000  // C2O on PK6
#define GPIO_PCTL_PK5_M         0x00F00000  // PK5 Mask
#define GPIO_PCTL_PK5_U7TX      0x00100000  // U7TX on PK5
#define GPIO_PCTL_PK5_M0FAULT1  0x00600000  // M0FAULT1 on PK5
#define GPIO_PCTL_PK5_C1O       0x00800000  // C1O on PK5
#define GPIO_PCTL_PK4_M         0x000F0000  // PK4 Mask
#define GPIO_PCTL_PK4_U7RX      0x00010000  // U7RX on PK4
#define GPIO_PCTL_PK4_M0FAULT0  0x00060000  // M0FAULT0 on PK4
#define GPIO_PCTL_PK4_RTCCLK    0x00070000  // RTCCLK on PK4
#define GPIO_PCTL_PK4_C0O       0x00080000  // C0O on PK4
#define GPIO_PCTL_PK3_M         0x0000F000  // PK3 Mask
#define GPIO_PCTL_PK3_AIN19     0x00000000  // AIN19 on PK3
#define GPIO_PCTL_PK3_SSI3TX    0x00002000  // SSI3TX on PK3
#define GPIO_PCTL_PK3_M1FAULT3  0x00006000  // M1FAULT3 on PK3
#define GPIO_PCTL_PK2_M         0x00000F00  // PK2 Mask
#define GPIO_PCTL_PK2_AIN18     0x00000000  // AIN18 on PK2
#define GPIO_PCTL_PK2_SSI3RX    0x00000200  // SSI3RX on PK2
#define GPIO_PCTL_PK2_M1FAULT2  0x00000600  // M1FAULT2 on PK2
#define GPIO_PCTL_PK1_M         0x000000F0  // PK1 Mask
#define GPIO_PCTL_PK1_AIN17     0x00000000  // AIN17 on PK1
#define GPIO_PCTL_PK1_SSI3FSS   0x00000020  // SSI3FSS on PK1
#define GPIO_PCTL_PK1_M1FAULT1  0x00000060  // M1FAULT1 on PK1
#define GPIO_PCTL_PK0_M         0x0000000F  // PK0 Mask
#define GPIO_PCTL_PK0_AIN16     0x00000000  // AIN16 on PK0
#define GPIO_PCTL_PK0_SSI3CLK   0x00000002  // SSI3CLK on PK0
#define GPIO_PCTL_PK0_M1FAULT0  0x00000006  // M1FAULT0 on PK0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port L.
//
//*****************************************************************************
#define GPIO_PCTL_PL7_M         0xF0000000  // PL7 Mask
#define GPIO_PCTL_PL7_USB0DM    0x00000000  // USB0DM on PL7
#define GPIO_PCTL_PL7_T3CCP1    0x70000000  // T3CCP1 on PL7
#define GPIO_PCTL_PL7_WT3CCP1   0x80000000  // WT3CCP1 on PL7
#define GPIO_PCTL_PL6_M         0x0F000000  // PL6 Mask
#define GPIO_PCTL_PL6_USB0DP    0x00000000  // USB0DP on PL6
#define GPIO_PCTL_PL6_T3CCP0    0x07000000  // T3CCP0 on PL6
#define GPIO_PCTL_PL6_WT3CCP0   0x08000000  // WT3CCP0 on PL6
#define GPIO_PCTL_PL5_M         0x00F00000  // PL5 Mask
#define GPIO_PCTL_PL5_T2CCP1    0x00700000  // T2CCP1 on PL5
#define GPIO_PCTL_PL5_WT2CCP1   0x00800000  // WT2CCP1 on PL5
#define GPIO_PCTL_PL4_M         0x000F0000  // PL4 Mask
#define GPIO_PCTL_PL4_T2CCP0    0x00070000  // T2CCP0 on PL4
#define GPIO_PCTL_PL4_WT2CCP0   0x00080000  // WT2CCP0 on PL4
#define GPIO_PCTL_PL3_M         0x0000F000  // PL3 Mask
#define GPIO_PCTL_PL3_T1CCP1    0x00007000  // T1CCP1 on PL3
#define GPIO_PCTL_PL3_WT1CCP1   0x00008000  // WT1CCP1 on PL3
#define GPIO_PCTL_PL2_M         0x00000F00  // PL2 Mask
#define GPIO_PCTL_PL2_T1CCP0    0x00000700  // T1CCP0 on PL2
#define GPIO_PCTL_PL2_WT1CCP0   0x00000800  // WT1CCP0 on PL2
#define GPIO_PCTL_PL1_M         0x000000F0  // PL1 Mask
#define GPIO_PCTL_PL1_T0CCP1    0x00000070  // T0CCP1 on PL1
#define GPIO_PCTL_PL1_WT0CCP1   0x00000080  // WT0CCP1 on PL1
#define GPIO_PCTL_PL0_M         0x0000000F  // PL0 Mask
#define GPIO_PCTL_PL0_T0CCP0    0x00000007  // T0CCP0 on PL0
#define GPIO_PCTL_PL0_WT0CCP0   0x00000008  // WT0CCP0 on PL0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port M.
//
//*****************************************************************************
#define GPIO_PCTL_PM7_M         0xF0000000  // PM7 Mask
#define GPIO_PCTL_PM7_M0PWM5    0x20000000  // M0PWM5 on PM7
#define GPIO_PCTL_PM7_WT0CCP1   0x70000000  // WT0CCP1 on PM7
#define GPIO_PCTL_PM6_M         0x0F000000  // PM6 Mask
#define GPIO_PCTL_PM6_M0PWM4    0x02000000  // M0PWM4 on PM6
#define GPIO_PCTL_PM6_WT0CCP0   0x07000000  // WT0CCP0 on PM6
#define GPIO_PCTL_PM5_M         0x00F00000  // PM5 Mask
#define GPIO_PCTL_PM4_M         0x000F0000  // PM4 Mask
#define GPIO_PCTL_PM3_M         0x0000F000  // PM3 Mask
#define GPIO_PCTL_PM3_T5CCP1    0x00007000  // T5CCP1 on PM3
#define GPIO_PCTL_PM3_WT5CCP1   0x00008000  // WT5CCP1 on PM3
#define GPIO_PCTL_PM2_M         0x00000F00  // PM2 Mask
#define GPIO_PCTL_PM2_T5CCP0    0x00000700  // T5CCP0 on PM2
#define GPIO_PCTL_PM2_WT5CCP0   0x00000800  // WT5CCP0 on PM2
#define GPIO_PCTL_PM1_M         0x000000F0  // PM1 Mask
#define GPIO_PCTL_PM1_T4CCP1    0x00000070  // T4CCP1 on PM1
#define GPIO_PCTL_PM1_WT4CCP1   0x00000080  // WT4CCP1 on PM1
#define GPIO_PCTL_PM0_M         0x0000000F  // PM0 Mask
#define GPIO_PCTL_PM0_T4CCP0    0x00000007  // T4CCP0 on PM0
#define GPIO_PCTL_PM0_WT4CCP0   0x00000008  // WT4CCP0 on PM0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port N.
//
//*****************************************************************************
#define GPIO_PCTL_PN7_M         0xF0000000  // PN7 Mask
#define GPIO_PCTL_PN7_M1PWM7    0x20000000  // M1PWM7 on PN7
#define GPIO_PCTL_PN7_WT4CCP1   0x70000000  // WT4CCP1 on PN7
#define GPIO_PCTL_PN6_M         0x0F000000  // PN6 Mask
#define GPIO_PCTL_PN6_M1PWM6    0x02000000  // M1PWM6 on PN6
#define GPIO_PCTL_PN6_WT4CCP0   0x07000000  // WT4CCP0 on PN6
#define GPIO_PCTL_PN5_M         0x00F00000  // PN5 Mask
#define GPIO_PCTL_PN5_M1PWM5    0x00200000  // M1PWM5 on PN5
#define GPIO_PCTL_PN5_WT3CCP1   0x00700000  // WT3CCP1 on PN5
#define GPIO_PCTL_PN4_M         0x000F0000  // PN4 Mask
#define GPIO_PCTL_PN4_M1PWM4    0x00020000  // M1PWM4 on PN4
#define GPIO_PCTL_PN4_WT3CCP0   0x00070000  // WT3CCP0 on PN4
#define GPIO_PCTL_PN3_M         0x0000F000  // PN3 Mask
#define GPIO_PCTL_PN3_M0PWM7    0x00002000  // M0PWM7 on PN3
#define GPIO_PCTL_PN3_WT2CCP1   0x00007000  // WT2CCP1 on PN3
#define GPIO_PCTL_PN2_M         0x00000F00  // PN2 Mask
#define GPIO_PCTL_PN2_M0PWM6    0x00000200  // M0PWM6 on PN2
#define GPIO_PCTL_PN2_WT2CCP0   0x00000700  // WT2CCP0 on PN2
#define GPIO_PCTL_PN1_M         0x000000F0  // PN1 Mask
#define GPIO_PCTL_PN1_CAN0TX    0x00000010  // CAN0TX on PN1
#define GPIO_PCTL_PN0_M         0x0000000F  // PN0 Mask
#define GPIO_PCTL_PN0_CAN0RX    0x00000001  // CAN0RX on PN0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port P.
//
//*****************************************************************************
#define GPIO_PCTL_PP2_M         0x00000F00  // PP2 Mask
#define GPIO_PCTL_PP2_M0PWM2    0x00000100  // M0PWM2 on PP2
#define GPIO_PCTL_PP2_T5CCP0    0x00000700  // T5CCP0 on PP2
#define GPIO_PCTL_PP1_M         0x000000F0  // PP1 Mask
#define GPIO_PCTL_PP1_AIN22     0x00000000  // AIN22 on PP1
#define GPIO_PCTL_PP1_M0PWM1    0x00000010  // M0PWM1 on PP1
#define GPIO_PCTL_PP1_T4CCP1    0x00000070  // T4CCP1 on PP1
#define GPIO_PCTL_PP0_M         0x0000000F  // PP0 Mask
#define GPIO_PCTL_PP0_AIN23     0x00000000  // AIN23 on PP0
#define GPIO_PCTL_PP0_M0PWM0    0x00000001  // M0PWM0 on PP0
#define GPIO_PCTL_PP0_T4CCP0    0x00000007  // T4CCP0 on PP0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR0 register.
//
//*****************************************************************************
#define SSI_CR0_SCR_M           0x0000FF00  // SSI Serial Clock Rate
#define SSI_CR0_SPH             0x00000080  // SSI Serial Clock Phase
#define SSI_CR0_SPO             0x00000040  // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M           0x00000030  // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO        0x00000000  // Freescale SPI Frame Format
#define SSI_CR0_FRF_TI          0x00000010  // Synchronous Serial Frame Format
#define SSI_CR0_FRF_NMW         0x00000020  // MICROWIRE Frame Format
#define SSI_CR0_DSS_M           0x0000000F  // SSI Data Size Select
#define SSI_CR0_DSS_4           0x00000003  // 4-bit data
#define SSI_CR0_DSS_5           0x00000004  // 5-bit data
#define SSI_CR0_DSS_6           0x00000005  // 6-bit data
#define SSI_CR0_DSS_7           0x00000006  // 7-bit data
#define SSI_CR0_DSS_8           0x00000007  // 8-bit data
#define SSI_CR0_DSS_9           0x00000008  // 9-bit data
#define SSI_CR0_DSS_10          0x00000009  // 10-bit data
#define SSI_CR0_DSS_11          0x0000000A  // 11-bit data
#define SSI_CR0_DSS_12          0x0000000B  // 12-bit data
#define SSI_CR0_DSS_13          0x0000000C  // 13-bit data
#define SSI_CR0_DSS_14          0x0000000D  // 14-bit data
#define SSI_CR0_DSS_15          0x0000000E  // 15-bit data
#define SSI_CR0_DSS_16          0x0000000F  // 16-bit data
#define SSI_CR0_SCR_S           8

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR1 register.
//
//*****************************************************************************
#define SSI_CR1_EOT             0x00000010  // End of Transmission
#define SSI_CR1_MS              0x00000004  // SSI Master/Slave Select
#define SSI_CR1_SSE             0x00000002  // SSI Synchronous Serial Port
                                            // Enable
#define SSI_CR1_LBM             0x00000001  // SSI Loopback Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DR register.
//
//*****************************************************************************
#define SSI_DR_DATA_M           0x0000FFFF  // SSI Receive/Transmit Data
#define SSI_DR_DATA_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_SR register.
//
//*****************************************************************************
#define SSI_SR_BSY              0x00000010  // SSI Busy Bit
#define SSI_SR_RFF              0x00000008  // SSI Receive FIFO Full
#define SSI_SR_RNE              0x00000004  // SSI Receive FIFO Not Empty
#define SSI_SR_TNF              0x00000002  // SSI Transmit FIFO Not Full
#define SSI_SR_TFE              0x00000001  // SSI Transmit FIFO Empty

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CPSR register.
//
//*****************************************************************************
#define SSI_CPSR_CPSDVSR_M      0x000000FF  // SSI Clock Prescale Divisor
#define SSI_CPSR_CPSDVSR_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_IM register.
//
//*****************************************************************************
#define SSI_IM_TXIM             0x00000008  // SSI Transmit FIFO Interrupt Mask
#define SSI_IM_RXIM             0x00000004  // SSI Receive FIFO Interrupt Mask
#define SSI_IM_RTIM             0x00000002  // SSI Receive Time-Out Interrupt
                                            // Mask
#define SSI_IM_RORIM            0x00000001  // SSI Receive Overrun Interrupt
                                            // Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_RIS register.
//
//*****************************************************************************
#define SSI_RIS_TXRIS           0x00000008  // SSI Transmit FIFO Raw Interrupt
                                            // Status
#define SSI_RIS_RXRIS           0x00000004  // SSI Receive FIFO Raw Interrupt
                                            // Status
#define SSI_RIS_RTRIS           0x00000002  // SSI Receive Time-Out Raw
                                            // Interrupt Status
#define SSI_RIS_RORRIS          0x00000001  // SSI Receive Overrun Raw
                                            // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_MIS register.
//
//*****************************************************************************
#define SSI_MIS_TXMIS           0x00000008  // SSI Transmit FIFO Masked
                                            // Interrupt Status
#define SSI_MIS_RXMIS           0x00000004  // SSI Receive FIFO Masked
                                            // Interrupt Status
#define SSI_MIS_RTMIS           0x00000002  // SSI Receive Time-Out Masked
                                            // Interrupt Status
#define SSI_MIS_RORMIS          0x00000001  // SSI Receive Overrun Masked
                                            // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_ICR register.
//
//*****************************************************************************
#define SSI_ICR_RTIC            0x00000002  // SSI Receive Time-Out Interrupt
                                            // Clear
#define SSI_ICR_RORIC           0x00000001  // SSI Receive Overrun Interrupt
                                            // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DMACTL register.
//
//*****************************************************************************
#define SSI_DMACTL_TXDMAE       0x00000002  // Transmit DMA Enable
#define SSI_DMACTL_RXDMAE       0x00000001  // Receive DMA Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CC register.
//
//*****************************************************************************
#define SSI_CC_CS_M             0x0000000F  // SSI Baud Clock Source
#define SSI_CC_CS_SYSPLL        0x00000000  // System clock (based on clock
                                            // source and divisor factor)
#define SSI_CC_CS_PIOSC         0x00000005  // PIOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_DR register.
//
//*****************************************************************************
#define UART_DR_OE              0x00000800  // UART Overrun Error
#define UART_DR_BE              0x00000400  // UART Break Error
#define UART_DR_PE              0x00000200  // UART Parity Error
#define UART_DR_FE              0x00000100  // UART Framing Error
#define UART_DR_DATA_M          0x000000FF  // Data Transmitted or Received
#define UART_DR_DATA_S          0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_RSR register.
//
//*****************************************************************************
#define UART_RSR_OE             0x00000008  // UART Overrun Error
#define UART_RSR_BE             0x00000004  // UART Break Error
#define UART_RSR_PE             0x00000002  // UART Parity Error
#define UART_RSR_FE             0x00000001  // UART Framing Error

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ECR register.
//
//*****************************************************************************
#define UART_ECR_DATA_M         0x000000FF  // Error Clear
#define UART_ECR_DATA_S         0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_FR register.
//
//*****************************************************************************
#define UART_FR_RI              0x00000100  // Ring Indicator
#define UART_FR_TXFE            0x00000080  // UART Transmit FIFO Empty
#define UART_FR_RXFF            0x00000040  // UART Receive FIFO Full
#define UART_FR_TXFF            0x00000020  // UART Transmit FIFO Full
#define UART_FR_RXFE            0x00000010  // UART Receive FIFO Empty
#define UART_FR_BUSY            0x00000008  // UART Busy
#define UART_FR_DCD             0x00000004  // Data Carrier Detect
#define UART_FR_DSR             0x00000002  // Data Set Ready
#define UART_FR_CTS             0x00000001  // Clear To Send

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ILPR register.
//
//*****************************************************************************
#define UART_ILPR_ILPDVSR_M     0x000000FF  // IrDA Low-Power Divisor
#define UART_ILPR_ILPDVSR_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_IBRD register.
//
//*****************************************************************************
#define UART_IBRD_DIVINT_M      0x0000FFFF  // Integer Baud-Rate Divisor
#define UART_IBRD_DIVINT_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_FBRD register.
//
//*****************************************************************************
#define UART_FBRD_DIVFRAC_M     0x0000003F  // Fractional Baud-Rate Divisor
#define UART_FBRD_DIVFRAC_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_LCRH register.
//
//*****************************************************************************
#define UART_LCRH_SPS           0x00000080  // UART Stick Parity Select
#define UART_LCRH_WLEN_M        0x00000060  // UART Word Length
#define UART_LCRH_WLEN_5        0x00000000  // 5 bits (default)
#define UART_LCRH_WLEN_6        0x00000020  // 6 bits
#define UART_LCRH_WLEN_7        0x00000040  // 7 bits
#define UART_LCRH_WLEN_8        0x00000060  // 8 bits
#define UART_LCRH_FEN           0x00000010  // UART Enable FIFOs
#define UART_LCRH_STP2          0x00000008  // UART Two Stop Bits Select
#define UART_LCRH_EPS           0x00000004  // UART Even Parity Select
#define UART_LCRH_PEN           0x00000002  // UART Parity Enable
#define UART_LCRH_BRK           0x00000001  // UART Send Break

